erpdev.СХК_Расширение/src/Reports/СХК_ОстаткиПоЯчейкам/СХК_ОстаткиПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СХК_ОстаткиПоЯчейкам</name>
</mdclass:Report>

erpdev.СХК_Расширение/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Reports/СХК_ОстаткиПоЯчейкам/ObjectModule.bsl
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроекФормы, Истина);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;   
	
КонецПроцедуры 

Процедура УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы)
	ПараметрДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");  
	ПараметрДатаОтчета.Использование = Истина;
	
КонецПроцедуры


#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	//ДатаНачала = ТекущаяДата()-180*86400;
	//ДатаОкончания = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	//
	//// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	//	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	//	
	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);
	//
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//
	ТабОстатки = Платежи();
		//
	ВнешниеНаборыДанных = Новый Структура("ТабОстатки", ТабОстатки);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	//ПроцессорВывода.ЗакончитьВывод();
	

КонецПроцедуры    
#КонецОбласти 


Функция Платежи()  
	
	ДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.Дата;;	
	//ДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.ДатаНачала;	
	
	Таб = Новый ТаблицаЗначений; 
	Таб.Колонки.Добавить("Номенклатура");
	Таб.Колонки.Добавить("Серия");
	Таб.Колонки.Добавить("Ячейка");
	Таб.Колонки.Добавить("ВНаличииОстатокГП");
	//Таб.Колонки.Добавить("ВНаличииОстатокЯчейка");  
	Таб.Колонки.Добавить("ВНаличииОстаток");  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Серия КАК Серия,
	               |	СУММА(ВложенныйЗапрос.ВНаличииОстатокГП) КАК ВНаличииОстатокГП,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |		СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |		0 КАК ВНаличииОстатокГП,
	               |		СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстатокЯчейка
	               |	ИЗ
	               |		РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОтчета, ) КАК СХК_ТоварыНаСкладеОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ТоварыНаСкладахОстатки.Номенклатура,
	               |		ТоварыНаСкладахОстатки.Серия.Наименование,
	               |		ТоварыНаСкладахОстатки.ВНаличииОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОтчета, Склад = &СкладГП) КАК ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |		ПО ВложенныйЗапрос.Серия = СХК_ТоварыНаСкладеОстатки.Серия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура";
	              // |ГДЕ
	              // |	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("ДатаОтчета",КонецДня(ДатаОтчета)); 
	Запрос.УстановитьПараметр("СкладГП",Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции")); 

	Таб =  Запрос.Выполнить().Выгрузить();  
	Таб.Свернуть("Номенклатура,Серия,Ячейка,ВНаличииОстатокГП","ВНаличииОстаток");	
	Возврат Таб;
	
 КонецФункции
